StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/lwip-network-interface-integration/source/cy_lwip_dhcp_server.c
/* DHCP data structure */
typedef struct
{
    uint8_t  opcode;                     /* Packet opcode type */
    uint8_t  hardware_type;              /* Hardware addr type */
    uint8_t  hardware_addr_len;          /* Hardware addr length */
    uint8_t  hops;                       /* Gateway hops */
    uint32_t transaction_id;             /* Transaction ID */
    uint16_t second_elapsed;             /* Seconds since boot began */
    uint16_t flags;                      /* DCHP flags, reserved for future */
    uint8_t  client_ip_addr[4];          /* Client IP address */
    uint8_t  your_ip_addr[4];            /* 'Your' IP address */
    uint8_t  server_ip_addr[4];          /* Server IP address */
    uint8_t  gateway_ip_addr[4];         /* Gateway IP address */
    uint8_t  client_hardware_addr[16];   /* Client hardware address */
    uint8_t  legacy[192];                /* DHCP legacy header */
    uint8_t  magic[4];                   /* DHCP magic cookie */
    uint8_t  options[275];               /* Options area */
    /* as of RFC2131, it is of variable length */
} dhcp_header_t;

/******************************************************
 *               Static Function Declarations
 ******************************************************/

static const uint8_t* find_option (const dhcp_header_t* request, uint8_t option_num);
static bool get_client_ip_address_from_cache (const cy_lwip_mac_addr_t* client_mac_address, cy_lwip_ip_address_t* client_ip_address);
static cy_rslt_t add_client_to_cache (const cy_lwip_mac_addr_t* client_mac_address, const cy_lwip_ip_address_t* client_ip_address);
static void ipv4_to_string (char* buffer, uint32_t ipv4_address);
static void cy_dhcp_thread_func (cy_thread_arg_t thread_input);
static cy_rslt_t udp_create_socket(cy_lwip_udp_socket_t *socket, uint16_t port, cy_network_interface_context *iface_context);
static cy_rslt_t udp_delete_socket(cy_lwip_udp_socket_t *socket);
static cy_rslt_t udp_receive(cy_lwip_udp_socket_t *socket, cy_lwip_packet_t** packet, uint32_t timeout);
static cy_rslt_t packet_get_data(cy_lwip_packet_t *packet, uint16_t offset, uint8_t** data, uint16_t* fragment_available_data_length, uint16_t *total_available_data_length);
static cy_rslt_t packet_set_data_end(cy_lwip_packet_t *packet, uint8_t* data_end);
static cy_rslt_t packet_delete(cy_lwip_packet_t* packet);
static cy_rslt_t packet_create_udp(cy_lwip_packet_t** packet, uint8_t** data, uint16_t* available_space);
static cy_rslt_t internal_packet_create(cy_lwip_packet_t** packet, uint16_t content_length, uint8_t** data, uint16_t* available_space);
static cy_rslt_t cy_udp_send(cy_lwip_udp_socket_t* socket, const cy_lwip_ip_address_t* address, uint16_t port, cy_lwip_packet_t* packet);
static cy_rslt_t internal_udp_send(struct netconn* handler, cy_lwip_packet_t* packet, cy_network_hw_interface_type_t type, uint8_t index);
static void cy_ip_to_lwip(ip_addr_t *dest, const cy_lwip_ip_address_t *src);

/******************************************************
 *               Variable Definitions
 ******************************************************/

static cy_lwip_mac_addr_t             cached_mac_addresses[DHCP_IP_ADDRESS_CACHE_MAX];
static cy_lwip_ip_address_t           cached_ip_addresses [DHCP_IP_ADDRESS_CACHE_MAX];
static struct netif *net_interface    = NULL;
static bool is_dhcp_server_started    = false;
/******************************************************
 *               Function Definitions
 ******************************************************/

#define DHCP_THREAD_PRIORITY                  (CY_RTOS_PRIORITY_ABOVENORMAL)
#define DHCP_THREAD_STACK_SIZE                (3000)


cy_rslt_t cy_lwip_dhcp_server_start(cy_lwip_dhcp_server_t* server, cy_network_interface_context *iface_context)
{
    cy_rslt_t result;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    if(is_dhcp_server_started)
    {
        return CY_RSLT_SUCCESS;
    }

    if((server == NULL) || (iface_context->iface_type != CY_NETWORK_WIFI_AP_INTERFACE))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error DHCP bad arguments. iface_context->iface_type:[%d] \n", iface_context->iface_type);
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (cy_rtos_init_mutex(&dhcp_mutex) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire DHCP mutex \n");
        return CY_RSLT_NETWORK_DHCP_MUTEX_ERROR;
    }

    /* Create a DHCP socket */
    if((result = udp_create_socket(&server->socket, IPPORT_DHCPS, iface_context)) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : UDP socket creation failed \n");
        goto exit;
    }

    /* Clear the cache */
    memset(cached_mac_addresses, 0, sizeof(cached_mac_addresses));
    memset(cached_ip_addresses,  0, sizeof(cached_ip_addresses));

    /* Initialize the server quit flag - done here if a quit is requested before the thread runs */
    server->quit = false;

    /* Start the DHCP server thread */
    result = cy_rtos_create_thread(&server->thread, cy_dhcp_thread_func, "DHCPserver", NULL, DHCP_THREAD_STACK_SIZE, DHCP_THREAD_PRIORITY, (cy_thread_arg_t) server);
    if (result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : Unable to create the DHCP thread \n");
        udp_delete_socket(&server->socket);
    }

exit:
    if(result != CY_RSLT_SUCCESS)
    {
        cy_rtos_deinit_mutex(&dhcp_mutex);
    }
    else
    {
        is_dhcp_server_started = true;
    }

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): STOP \n", __FUNCTION__ );
    return result;
}

cy_rslt_t cy_lwip_dhcp_server_stop(cy_lwip_dhcp_server_t* server)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    if(!is_dhcp_server_started)
    {
        return CY_RSLT_SUCCESS;
    }

    if(server == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    server->quit = true;
    cy_rtos_terminate_thread(&server->thread);
    cy_rtos_join_thread(&server->thread);
    /* Delete DHCP socket */
    res = udp_delete_socket(&server->socket);
    cy_rtos_deinit_mutex(&dhcp_mutex);
    is_dhcp_server_started = false;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): STOP \n", __FUNCTION__ );
    return res;
}

/**
 *  Implements a very simple DHCP server.
 *
 *  The server will always offer the next available address to a DISCOVER command.
 *  The server will NAK any REQUEST command which is not requesting the next available address.
 *  The server will ACK any REQUEST command which is for the next available address, and then increment the next available address.
 *
 * @param my_addr : Local IP address for binding of the server port
 */
static void cy_dhcp_thread_func(cy_thread_arg_t thread_input)
{
    cy_lwip_packet_t             *received_packet;
    cy_lwip_packet_t             *transmit_packet = NULL;
    cy_lwip_ip_address_t         local_ip_address;
    cy_lwip_ip_address_t         netmask;
    uint32_t                     next_available_ip_addr;
    uint32_t                     ip_mask;
    uint32_t                     subnet;
    uint32_t                     netmask_htobe;
    uint32_t                     server_ip_addr_htobe;
    char                         *option_ptr;
    cy_lwip_dhcp_server_t        *server                      = (cy_lwip_dhcp_server_t*)thread_input;
    uint8_t                      subnet_mask_option_buff[]    = { DHCP_SUBNETMASK_OPTION_CODE, 4, 0, 0, 0, 0 };
    uint8_t                      server_ip_addr_option_buff[] = { DHCP_SERVER_IDENTIFIER_OPTION_CODE, 4, 0, 0, 0, 0 };
    uint8_t                      wpad_option_buff[ 2 + sizeof(WPAD_SAMPLE_URL)-1 ] = { DHCP_WPAD_OPTION_CODE, sizeof(WPAD_SAMPLE_URL)-1 };
    cy_lwip_ip_address_t         broadcast_addr;

    memset(&local_ip_address, 0x00, sizeof(cy_lwip_ip_address_t));

    SET_IPV4_ADDRESS(broadcast_addr, MAKE_IPV4_ADDRESS(255, 255, 255, 255));
    /* Save the local IP address to be sent in DHCP packets */

    net_interface = (struct netif *)cy_network_get_nw_interface( server->socket.type, server->socket.index );
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "DHCP_SERVER net_interface:[%p] \n", net_interface);

    local_ip_address.version = CY_LWIP_IP_VER_V4;
#if LWIP_IPV6
    local_ip_address.ip.v4 = ntohl(net_interface->ip_addr.u_addr.ip4.addr);
#else
    local_ip_address.ip.v4 = ntohl(net_interface->ip_addr.addr);
#endif

    server_ip_addr_htobe = htobe32(GET_IPV4_ADDRESS(local_ip_address));
    memcpy(&server_ip_addr_option_buff[2], &server_ip_addr_htobe, 4);

    /* Save the current netmask to be sent in DHCP packets as the 'subnet mask option' */
    netmask.version = CY_LWIP_IP_VER_V4;
#if LWIP_IPV4 && LWIP_IPV6
    netmask.ip.v4 = ntohl(net_interface->netmask.u_addr.ip4.addr);
#elif LWIP_IPV4
    netmask.ip.v4 = ntohl(net_interface->netmask.addr);
#endif
    netmask_htobe = htobe32(GET_IPV4_ADDRESS(netmask));
    memcpy(&subnet_mask_option_buff[2], &netmask_htobe, 4);

    /* Calculate the first available IP address which will be served - based on the netmask and the local IP address*/
    ip_mask = ~(GET_IPV4_ADDRESS(netmask));
    subnet = GET_IPV4_ADDRESS(local_ip_address) & GET_IPV4_ADDRESS(netmask);
    next_available_ip_addr = subnet | ((GET_IPV4_ADDRESS(local_ip_address) + 1) & ip_mask);

    /* Prepare the web proxy auto-discovery URL */
    memcpy(&wpad_option_buff[2], WPAD_SAMPLE_URL, sizeof(WPAD_SAMPLE_URL)-1);
    ipv4_to_string((char*)&wpad_option_buff[2 + 7], server_ip_addr_option_buff[2]);

