StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/lwip-network-interface-integration/source/cy_lwip_dhcp_server.c
                /* Record the client MAC address */
                memcpy( &client_mac_address, request_header->client_hardware_addr, sizeof( client_mac_address ) );


                /* Locate the requested address in the options and keep the requested address */
                requested_ip_address.version = CY_LWIP_IP_VER_V4;
                find_option_ptr = find_option( request_header, DHCP_REQUESTED_IP_ADDRESS_OPTION_CODE );
                if( find_option_ptr != NULL )
                {
                    requested_ip_address.ip.v4   = ntohl( LWIP_MAKEU32( find_option_ptr[3], find_option_ptr[2], find_option_ptr[1], find_option_ptr[0] ) );
                }

                /* Delete the received packet. Not required anymore */
                packet_delete( received_packet );

                reply_header->opcode = BOOTP_OP_REPLY;

                /* Blank options list */
                memset( &reply_header->options, 0, sizeof( reply_header->options ) );

                /* Copy the DHCP magic number into the packet */
                memcpy( reply_header->magic, dhcp_magic_cookie, 4 );

                option_ptr = (char *) &reply_header->options;

                /* Check if device is cached. If it is, give the previous IP address. Otherwise, give the next available IP address */
                if ( !get_client_ip_address_from_cache( &client_mac_address, &given_ip_address ) )
                {
                    /* Address not found in cache. Use the next available IP address */
                    next_avail_ip_address_used = true;
                    given_ip_address.version   = CY_LWIP_IP_VER_V4;
                    given_ip_address.ip.v4     = next_available_ip_addr;
                }

                /* Check if the requested IP address matches the assigned address */
                if ( memcmp( &requested_ip_address.ip.v4, &given_ip_address.ip.v4, sizeof( requested_ip_address.ip.v4 ) ) != 0 )
                {
                    /* Request is not for the assigned IP - force the client to take the next available IP address by sending NAK */
                    /* Add appropriate options */
                    option_ptr = (char*)MEMCAT( option_ptr, dhcp_nak_option_buff, 3 );             /* DHCP message type */
                    option_ptr = (char*)MEMCAT( option_ptr, server_ip_addr_option_buff, 6 );       /* Server identifier */
                    memset( reply_header->your_ip_addr, 0, sizeof( reply_header->your_ip_addr ) ); /* Clear the IP address     */
                }
                else
                {
                    /* Request is for the next available IP */
                    /* Add appropriate options */
                    option_ptr     = (char*)MEMCAT( option_ptr, dhcp_ack_option_buff, 3 );                              /* DHCP message type            */
                    option_ptr     = (char*)MEMCAT( option_ptr, server_ip_addr_option_buff, 6 );                        /* Server identifier            */
                    option_ptr     = (char*)MEMCAT( option_ptr, lease_time_option_buff, 6 );                            /* Lease time                   */
                    option_ptr     = (char*)MEMCAT( option_ptr, subnet_mask_option_buff, 6 );                           /* Subnet mask                  */
                    option_ptr     = (char*)MEMCAT( option_ptr, wpad_option_buff, sizeof(wpad_option_buff) );           /* Web proxy auto-discovery URL */
                    /* Copy the local IP address into the router & DNS server options */
                    memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* Router (gateway)             */
                    option_ptr[0]  = 3;                                                                                 /* Router ID                    */
                    option_ptr    += 6;
                    memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* DNS server                   */
                    option_ptr[0]  = 6;                                                                                 /* DNS server ID                */
                    option_ptr    += 6;
                    option_ptr     = (char*)MEMCAT( option_ptr, mtu_option_buff, 4 );                                   /* Interface MTU                */

                    /* Create the IP address for the Offer */
                    temp = htonl(given_ip_address.ip.v4);
                    memcpy( reply_header->your_ip_addr, &temp, sizeof( temp ) );

                    /* Increment the next available IP address only if not found in cache */
                    if ( next_avail_ip_address_used == true )
                    {
                        do
                        {
                            next_available_ip_addr = subnet | ( ( next_available_ip_addr + 1 ) & ip_mask );
                        } while ( next_available_ip_addr == GET_IPV4_ADDRESS(local_ip_address) );
                    }

                    /* Cache the client */
                    add_client_to_cache( &client_mac_address, &given_ip_address );
                }

                option_ptr[0] = (char) DHCP_END_OPTION_CODE; /* End options */
                option_ptr++;

                /* Send the reply packet */
                packet_set_data_end( transmit_packet, (uint8_t*) option_ptr );
                if (cy_udp_send( &server->socket, &broadcast_addr, IPPORT_DHCPC, transmit_packet ) != CY_RSLT_SUCCESS)
                {
                    packet_delete( transmit_packet );
                }
            }
            break;

            default:
                /* Unknown packet type - release the received packet */
                packet_delete( received_packet );
            break;
        }
    }
    cy_rtos_exit_thread();
}

/**
 *  Finds a specified DHCP option
 *
 *  Searches the given DHCP request and returns a pointer to the
 *  specified DHCP option data, or NULL if not found
 *
 * @param[out] request    : DHCP request structure
 * @param[in]  option_num : DHCP option number to find
 *
 * @return Pointer to the DHCP option data, or NULL if not found
 */
static const uint8_t* find_option( const dhcp_header_t* request, uint8_t option_num )
{
    const uint8_t* option_ptr = request->options;
    while ( ( option_ptr[0] != DHCP_END_OPTION_CODE ) &&                               /* Check for the end-of-options flag */
            ( option_ptr[0] != option_num ) &&                                         /* Check for the matching option number */
            ( option_ptr < ( (const uint8_t*) request ) + sizeof( dhcp_header_t ) ) )  /* Check for buffer overrun */
    {
        option_ptr += option_ptr[1] + 2;
    }

    /* Was the option found? */
    if ( option_ptr[0] == option_num )
    {
        return &option_ptr[2];
    }
    return NULL;
}

/**
 *  Searches the cache for a given MAC address to find the matching IP address
 *
 * @param[in]  client_mac_address : MAC address to search for
 * @param[out] client_ip_address  : Receives any IP address which is found
 *
 * @return true if found; false otherwise
 */
static bool get_client_ip_address_from_cache( const cy_lwip_mac_addr_t* client_mac_address, cy_lwip_ip_address_t* client_ip_address )
{
    uint32_t a;

