StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/lwip-network-interface-integration/source/cy_lwip_dhcp_server.c
    /* Check whether the device is already cached */
    for ( a = 0; a < DHCP_IP_ADDRESS_CACHE_MAX; a++ )
    {
        if ( memcmp( &cached_mac_addresses[ a ], client_mac_address, sizeof( *client_mac_address ) ) == 0 )
        {
            *client_ip_address = cached_ip_addresses[ a ];
            return true;
        }
    }

    return false;
}

/**
 *  Adds the MAC and IP addresses of a client to cache
 *
 * @param[in] client_mac_address : MAC address of the client to store
 * @param[in] client_ip_address  : IP address of the client to store
 *
 * @return CY_RSLT_SUCCESS
 */
static cy_rslt_t add_client_to_cache( const cy_lwip_mac_addr_t* client_mac_address, const cy_lwip_ip_address_t* client_ip_address )
{
    uint32_t a;
    uint32_t first_empty_slot;
    uint32_t cached_slot;

    /* Search for empty slot in cache */
    for ( a = 0, first_empty_slot = DHCP_IP_ADDRESS_CACHE_MAX, cached_slot = DHCP_IP_ADDRESS_CACHE_MAX; a < DHCP_IP_ADDRESS_CACHE_MAX; a++ )
    {
        /* Check for the matching MAC address */
        if ( memcmp( &cached_mac_addresses[ a ], client_mac_address, sizeof( *client_mac_address ) ) == 0 )
        {
            /* Cached device found */
            cached_slot = a;
            break;
        }
        else if ( first_empty_slot == DHCP_IP_ADDRESS_CACHE_MAX && memcmp( &cached_mac_addresses[ a ], &empty_cache, sizeof(cy_lwip_mac_addr_t) ) == 0 )
        {
            /* Device not found in cache. Return the first empty slot */
            first_empty_slot = a;
        }
    }

    if ( cached_slot != DHCP_IP_ADDRESS_CACHE_MAX )
    {
        /* Update the IP address of the cached device */
        cached_ip_addresses[cached_slot] = *client_ip_address;
    }
    else if ( first_empty_slot != DHCP_IP_ADDRESS_CACHE_MAX )
    {
        /* Add device to the first empty slot */
        cached_mac_addresses[ first_empty_slot ] = *client_mac_address;
        cached_ip_addresses [ first_empty_slot ] = *client_ip_address;
    }
    else
    {
        /* Cache is full. Add the device to slot 0 */
        cached_mac_addresses[ 0 ] = *client_mac_address;
        cached_ip_addresses [ 0 ] = *client_ip_address;
    }

    return CY_RSLT_SUCCESS;
}

/**
 * Converts a unsigned 32-bit long int to a decimal string
 *
 * @param value[in]      : Unsigned long to be converted.
 * @param output[out]    : Buffer which will receive the decimal string. A terminating 'null' is added. Ensure that there is space in the buffer for this.
 * @param min_length[in] : Minimum number of characters to output (zero padding will apply if required).
 * @param max_length[in] : Maximum number of characters to output. The max number of characters it can have is of the length of (ULONG_MAX + 1).
 *
 * @return The number of characters returned (excluding terminating null)
 *
 */
uint8_t unsigned_to_decimal_string( uint32_t value, char* output, uint8_t min_length, uint8_t max_length )
{
    uint8_t digits_left;
    char buffer[sizeof(ULONG_MAX_STR) + 1] = ULONG_MIN_STR; /* Buffer for storing ULONG_MAX with +1 for the sign */

    if ( output == NULL )
    {
        return 0;
    }

    max_length = (uint8_t) MIN( max_length, sizeof( buffer ) );
    digits_left = max_length;
    do
    {
        --digits_left;
        buffer[ digits_left ] = (char) (( value % 10 ) + '0');
        value = value / 10;
    } while ( ( value != 0 ) && ( digits_left != 0 ) );

    digits_left = (uint8_t) MIN( ( max_length - min_length ), digits_left );
    memcpy( output, &buffer[ digits_left ], (size_t)( max_length - digits_left ) );

    /* Add the terminating null */
    output[( max_length - digits_left )] = '\x00';

    return (uint8_t) ( max_length - digits_left );
}


/**
 *  Convert the IPv4 address to a string
 *
 *  @note: String is 16 bytes including the terminating null
 *
 * @param[out] buffer       : Buffer which will receive the IPv4 string
 * @param[in]  ipv4_address : IPv4 address to convert
 */
static void ipv4_to_string( char* buffer, uint32_t ipv4_address )
{
    uint8_t* ip = (uint8_t*)&ipv4_address;
    unsigned_to_decimal_string(ip[0], buffer, 3, 3);
    *(buffer + 3) = '.';
    unsigned_to_decimal_string(ip[1], buffer + 4, 3, 3);
    *(buffer + 7) = '.';
    unsigned_to_decimal_string(ip[2], buffer + 8, 3, 3);
    *(buffer + 11) = '.';
    unsigned_to_decimal_string(ip[3], buffer + 12, 3, 3);
}


static cy_rslt_t udp_create_socket(cy_lwip_udp_socket_t *socket, uint16_t port, cy_network_interface_context *iface_context)
{
    err_t status;
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    memset( socket, 0, sizeof(cy_lwip_udp_socket_t) );

    /* Call the wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    socket->conn_handler = netconn_new( NETCONN_UDP );
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "socket->conn_handler:[%p] \n", socket->conn_handler);

    if( socket->conn_handler == NULL )
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to create UDP socket \n");
        return CY_RSLT_NETWORK_SOCKET_CREATE_FAIL;
    }

    /* Call the wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "UDP socket :[%d]\n", port);
    /* Bind it to the designated port and IP address */
    status = netconn_bind( socket->conn_handler, IP_ANY_TYPE, port );
    if( status != ERR_OK )
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "socket bind failed \n");
        netconn_delete( socket->conn_handler );
        socket->conn_handler = NULL;
        return CY_RSLT_NETWORK_SOCKET_ERROR;
    }
    socket->is_bound  = true;
    socket->type = iface_context->iface_type;
    socket->index = iface_context->iface_idx;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t udp_delete_socket(cy_lwip_udp_socket_t *socket)
{
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    if (socket->conn_handler == NULL)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : Socket deletion failed due to invalid socket \n");
        return CY_RSLT_NETWORK_INVALID_SOCKET;
    }

    /* Call the wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    /* Note: No need to check return value of netconn_delete. It always returns ERR_OK */
    netconn_delete(socket->conn_handler);
    socket->conn_handler = NULL;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
}

