StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/lwip-network-interface-integration/source/cy_lwip_dhcp_server.c
static cy_rslt_t udp_receive(cy_lwip_udp_socket_t *socket, cy_lwip_packet_t** packet, uint32_t timeout)
{
    err_t status;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    if (socket->conn_handler == NULL)
    {
        return CY_RSLT_NETWORK_SOCKET_ERROR;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "socket->conn_handler:[%p] \n", socket->conn_handler);

    netconn_set_recvtimeout(socket->conn_handler, (int)timeout);
    status = netconn_recv(socket->conn_handler, packet);
    if ( status != ERR_OK )
    {
        return CY_RSLT_NETWORK_SOCKET_ERROR;
    }
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t packet_get_data(cy_lwip_packet_t *packet, uint16_t offset, uint8_t** data, uint16_t* fragment_available_data_length, uint16_t *total_available_data_length)
{
    s8_t get_next_result;

    netbuf_first( packet );
    *total_available_data_length = (uint16_t)( netbuf_len(packet) - offset );

    do
    {
        uint16_t frag_size = packet->ptr->len;
        *data        = packet->ptr->payload;

        if ( frag_size == 0 && *total_available_data_length == 0 )
        {
            *data                           = NULL;
            *fragment_available_data_length = 0;
            *total_available_data_length    = 0;
            return CY_RSLT_SUCCESS;
        }
        else if ( offset < frag_size )
        {
            *data += offset;
            *fragment_available_data_length = (uint16_t)(frag_size - offset);
            return CY_RSLT_SUCCESS;
        }
        else
        {
            offset = (uint16_t)(offset - frag_size);
            get_next_result = netbuf_next( packet );
        }
    } while ( get_next_result != -1 );

    return CY_RSLT_NETWORK_CORRUPT_BUFFER;
}

static cy_rslt_t packet_set_data_end(cy_lwip_packet_t *packet, uint8_t* data_end)
{
    packet->ptr->len     = (uint16_t) ( data_end - ( (uint8_t*) packet->ptr->payload ) );
    packet->p->tot_len = packet->p->len;

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t packet_delete(cy_lwip_packet_t* packet)
{
    netbuf_delete( packet );
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_udp_send(cy_lwip_udp_socket_t* socket, const cy_lwip_ip_address_t* address, uint16_t port, cy_lwip_packet_t* packet)
{
    ip_addr_t temp;
    err_t status;
    cy_rslt_t result;

    if((socket == NULL) || (address == NULL) || (packet == NULL))
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /* Associate the UDP socket with the specific remote IP address and port */
    cy_ip_to_lwip(&temp, address);

    /* Call the wifi-mw-core network activity function to resume the network stack */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    status = netconn_connect(socket->conn_handler, &temp, port);
    if ( status != ERR_OK )
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket error unable to associate socket with IP address \n");
        return CY_RSLT_NETWORK_SOCKET_ERROR;
    }

    /* Total length and a length must be equal for a packet to be valid */
    packet->p->len = packet->p->tot_len;

    /* Send the packet via the UDP socket */
    result = internal_udp_send(socket->conn_handler, packet, (cy_network_hw_interface_type_t)socket->type, socket->index);
    if ( result != CY_RSLT_SUCCESS )
    {
        /* Call the wifi-mw-core network activity function to resume the network stack */
        cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

        netconn_disconnect(socket->conn_handler);
        return result;
    }

    netbuf_delete( packet );

    /* Call the wifi-mw-core network activity function to resume the network stack */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    /* Return to the disconnected state
     * Note: Ignore the return for this because CY_RSLT_SUCCESS MUST be returned; otherwise, the caller may attempt to
     * free the packet a second time.
     */
    netconn_disconnect(socket->conn_handler);
    return CY_RSLT_SUCCESS;
}

void cy_ip_to_lwip(ip_addr_t *dest, const cy_lwip_ip_address_t *src)
{
    if(src->version == CY_LWIP_IP_VER_V4)
    {
        ip_addr_set_ip4_u32(dest, htonl(GET_IPV4_ADDRESS(*src)));
    }
}

static cy_rslt_t internal_udp_send(struct netconn* handler, cy_lwip_packet_t* packet,
        cy_network_hw_interface_type_t type, uint8_t index)
{
    #if LWIP_DHCP
    err_t status;
    if(cy_rtos_get_mutex(&dhcp_mutex, CY_DHCP_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_DHCP_WAIT_TIMEOUT;
    }

    /* Call the wifi-mw-core network activity function to resume the network stack */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    /* Bind the interface to the socket */
    udp_bind_netif(handler->pcb.udp, cy_network_get_nw_interface(type, index));

    /* Send a packet */
    packet->p->len = packet->p->tot_len;
    status = netconn_send( handler, packet );
    if (cy_rtos_set_mutex(&dhcp_mutex) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_DHCP_MUTEX_ERROR;
    }
    netbuf_free(packet);
    return ((status == CY_RSLT_SUCCESS) ? CY_RSLT_SUCCESS : CY_RSLT_NETWORK_SOCKET_ERROR);
    #else
    return CY_RSLT_NETWORK_SOCKET_ERROR;
    #endif
}

static cy_rslt_t packet_create_udp(cy_lwip_packet_t** packet, uint8_t** data, uint16_t* available_space )
{
    return internal_packet_create(packet, MAX_UDP_PAYLOAD_SIZE, data, available_space);
}

static cy_rslt_t internal_packet_create( cy_lwip_packet_t** packet, uint16_t content_length, uint8_t** data, uint16_t* available_space )
{
    int i = 0;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
    for (i = 0; i < ALLOCATE_PACKET_TIMEOUT; ++i)
    {
        *packet = netbuf_new();
        if (*packet != NULL)
        {
            *data = netbuf_alloc(*packet, content_length);
            if (*data != NULL)
            {
                *available_space = content_length;
                return CY_RSLT_SUCCESS;
            }
            netbuf_delete(*packet);
            *packet = NULL;
            *available_space = 0;
        }
        cy_rtos_delay_milliseconds(1);
    }

    *available_space = 0;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return CY_RSLT_NETWORK_DHCP_TIMEOUT;
}
#endif //LWIP_IPV4
